app/controllers/application_controller.rb

SELECT "tenants".* FROM "tenants" ORDER BY "tenants"."id" ASC LIMIT 1
---
  def current_tenant
    @current_tenant ||= Tenant.first || Tenant.create!(name: 'Thomas IT Demo', subdomain: 'demo')