app/controllers/tenant_scope/batches_controller.rb

SELECT "batches".* FROM "batches" WHERE "batches"."id" = 1 LIMIT 1
---
    def public_pdf
      @batch = Batch.find(params[:id])

SELECT "batches".* FROM "batches" WHERE "batches"."tenant_id" = 1 AND "batches"."id" = NULL LIMIT 1
---
    def set_tenant_batches
      tenant = current_tenant
      @tenant_batches = Batch.where(tenant: tenant) if tenant